src_ext/Catalogs/УЗ_Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Тарифы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьИсториюЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Catalogs/УЗ_Тарифы/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Или ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;

	//предупреждения о неполной цене — только у одной цены в карточке: у цен по датам поля карточки не используются
	//(прежде «Не указана сумма!!!» выводилось при каждой записи тарифа с историей цен)
	Если Не ИспользоватьИсториюЦен Тогда
		Если КоличествоУроков = 0 И КоличествоЧасов = 0 Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'У тарифа не указано количество уроков или часов — цены нет, урок «К оплате» с ним не проведётся'"));
		КонецЕсли;
		Если Сумма = 0 Тогда
			УЗ_ОбщийКлиентСервер.СообщитьПользователю(НСтр("ru = 'У тарифа не указана сумма — цены нет, урок «К оплате» с ним не проведётся'"));
		КонецЕсли;
	КонецЕсли;

	//Р2/В8 (решение владельца 28.09.2026, как в типовых): одна цена в карточке тоже фиксируется на дату —
	//прежняя и новая цены пишутся в историю цен (РегистрыСведений.УЗ_ЦеныТарифов.ЗафиксироватьЦенуКарточки),
	//урок берёт цену на свою дату, и перепроведение старого урока новую цену не возьмёт
	Если Не ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Тарифы.Сумма КАК Сумма,
		|	Тарифы.КоличествоЧасов КАК КоличествоЧасов,
		|	Тарифы.КоличествоУроков КАК КоличествоУроков
		|ИЗ
		|	Справочник.УЗ_Тарифы КАК Тарифы
		|ГДЕ
		|	Тарифы.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий()
			И (Выборка.Сумма <> Сумма Или Выборка.КоличествоЧасов <> КоличествоЧасов
				Или Выборка.КоличествоУроков <> КоличествоУроков) Тогда
			ДополнительныеСвойства.Вставить("ПрежняяЦенаКарточки", Новый Структура("Сумма, КоличествоЧасов, КоличествоУроков",
				Выборка.Сумма, Выборка.КоличествоЧасов, Выборка.КоличествоУроков));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Или ЭтоГруппа Или Не ДополнительныеСвойства.Свойство("ПрежняяЦенаКарточки") Тогда
		Возврат;
	КонецЕсли;

	НоваяЦена = Новый Структура("Сумма, КоличествоЧасов, КоличествоУроков", Сумма, КоличествоЧасов, КоличествоУроков);
	РегистрыСведений.УЗ_ЦеныТарифов.ЗафиксироватьЦенуКарточки(Ссылка, ДополнительныеСвойства.ПрежняяЦенаКарточки,
		НоваяЦена, Не ИспользоватьИсториюЦен);

КонецПроцедуры
